Repository: visionstech/diabetesapp_ios
Catalog: DiabetesApp/*.lproj/Localizable.strings
Languages: ar

# SA_STR_OK
source: Ok
ar: حسنا

# SA_STR_CANCEL
source: Cancel
ar: الغاء

# SA_STR_LOADING
source: Loading
ar: جار اتحميل

# SA_STR_LOGGED_IN
source: Logged in
ar: تم تسجيل الدخول

# SA_STR_SENDING
source: Sending
ar: جار الارسال

# SA_STR_COMPLETED
source: Completed
ar: تم

# SA_STR_DELETE
source: Leave
ar: يترك

# SA_STR_DELETED
source: Left
ar: ترك

# SA_STR_DELETING
source: Leaving...
ar: جار الترك . . .

# SA_STR_WARNING
source: Warning
ar: انذار

# SA_STR_LOGIN_AS
source: Login as
ar: تسجبل دخول ك

# SA_STR_LOGOUT
source: Logout
ar: تسجيل خروج

# SA_STR_LOGOUTING
source: Logout...
ar: تسجيل جروج . . .

# SA_STR_TYPING
source: Typing...
ar: جار الكتابة . . .

# SA_STR_CONNECTING_TO_CHAT
source: Connecting to chat...
ar: جار الاتصال بالمحادثة. . .

# SA_STR_CONNECTED
source: Connected
ar: متصل

# SA_STR_DISCONNECTED
source: Disconnected
ar: انقطع الاتصال

# SA_STR_RECONNECTED
source: Reconnected
ar: اعادة الاتصال

# SA_STR_LOGGING_IN_AS
source: Logging in
ar: جار تسجيل الدخول

# SA_STR_LOADING_DIALOG
source: Loading dialog
ar: جار تحميل الحوار

# SA_STR_LOADING_DIALOGS
source: Loading dialogs
ar: جار تحميل الحوارات

# SA_STR_DONE
source: Done
ar: تم

# SA_STR_ADDED
source: added
ar: تمت الاضافة

# SA_STR_CREATE_NEW
source: created new dialog with:
ar: تم انشاء محادثة جديدة مع:

# SA_STR_CALL
source: Call
ar: اتصل

# SA_STR_MESSAGE_PLACEHOLDER
source: Message
ar: رسالة

# SA_STR_CANT_SEND_A_MESSAGE
source: Can't send a message
ar: لا تستطيع ارسال رسالة

# SA_STR_LOADING_USERS
source: Loading users
ar: جار تحميل المستخدمين

# SA_STR_CANT_DOWNLOAD_DIALOGS
source: Can't download dialogs
ar: لا تستطيع تحميل الحوارات

# SA_STR_FAILED_LOAD_DIALOGS
source: Failed to load dialogs
ar: فشل تحميل الحوارات

# SA_STR_LOADING_MESSAGES
source: Loading messages
ar: جار تحميل الرسائل

# SA_STR_UPLOADING_ATTACHMENT
source: Uploading attachment
ar: جار رفع المرفق

# SA_STR_ENTER_CHAT_NAME
source: Enter chat name
ar: اكتب اسم محادثة

# STR_DIALOG_CREATED
source: Dialog created
ar: تم نشأ الحوار

# SA_STR_CHAT_SEND
source: Send
ar: ارسل

# SA_STR_LAST_ACTIVITY_DATE
source: last_activity_date
ar: اخر تاريخ التواجد

# SA_STR_ADD_OCCUPANTS
source: Add occupants
ar: اضف مستخدمين

# SA_STR_CREATE
source: Create
ar: انشأ

# SA_STR_NEW_CHAT
source: New chat
ar: محادثة جديدة

# SA_STR_NEW_MESSAGE
source: New message
ar: رسالة جديدة

# SA_STR_USER_HAS_LEFT
source: has left dialog.
ar: تم ترك الحوار.

# SA_STR_CHAT_INFO
source: Chat info
ar: معلومات المحادثة

# SA_STR_READ_STATUS
source: Read
ar: قرأت

# SA_STR_DELIVERED_STATUS
source: Delivered
ar: وصلت

# SA_STR_SEEN_STATUS
source: Seen
ar: تمت الرؤية

# SA_STR_SENT_STATUS
source: Sent
ar: تم الارسال

# SA_STR_NOT_SENT_STATUS
source: Didn't send
ar: لم ترسل

# SA_STR_SENDING_STATUS
source: Sending
ar: جار الارسال

# SA_STR_UNKNOWN_USER
source: Unknown
ar: غيز معروف

# SA_STR_PRIVATE
source: private
ar: خاص

# SA_STR_GROUP
source: group
ar: مجموعة

# SA_STR_PUBLIC_GROUP
source: public group
ar: مجموعة عامة

# SA_STR_ADDITIONAL_ACTIONS
source: Additional actions
ar: اجراءات اضافية

# SA_STR_DO_YOU_REALLY_WANT_TO_DELETE_SELECTED_DIALOG
source: Do you really want to leave selected dialog?
ar: هل تريد بجديةأن تمسح الحوار المختار

# SA_STR_TRY_AGAIN_MESSAGE
source: Try again
ar: حاول مرة آخري

# SA_STR_DELETE_MESSAGE
source: Delete
ar: امسح

# SA_STR_ERROR
source: Error
ar: خطأ

# SA_STR_ERROR_DELETING
source: Error leaving
ar: خطأ ترك

# SA_STR_BAD_GATEWAY
source: Bad Gateway, please try again
ar: بوابة خاطئة ، الرجاء المحاولة مرة اخري

# SA_STR_NETWORK_ERROR
source: Connection network error, please try again
ar: خطأ الاتصال بالشبكة ، الرجاء المحاولة مرة أخري

# SA_STR_DID_NOT_CONNECT_ERROR
source: Did not connect with error:
ar: لم يتم الاتصال بالخطأ:

# SA_STR_FAILED_TO_CONNECT_WITH_ERROR
source: Chat failed with error:
ar: فشل المحادثة مع الخطأ

# SA_STR_CANNOT_CREATE_DIALOG
source: Can not create dialog
ar: لا تستطيع انشاء حوار

# SA_STR_MESSAGE_FAILED_TO_SEND
source: Message failed to send
ar: فشل ارسال الرسالة

# SA_STR_PUSH_NOTIFICATION_MESSAGE
source: message
ar: رسالة

# SA_STR_DELETE_MEDICATION
source: Delete medications
ar: حذف الأدوية

# SA_STR_DELETE_READING
source: Delete readings
ar: حذف قراءات

source: Ok
ar: حسنا

source: Doctor
ar: طبيب

source: Patient
ar: مريض

source: Educator
ar: مثقف

source: Logout
ar: تسجيل خروج

source: Select user type
ar: اختر نوع المستخدم

source: Contacts
ar: جهات اتصال

source: Done
ar: تم

source: Camera
ar: الة تصوير

source: Photo Library
ar: مكتبة الصور

source: Cancel
ar: الغاء

source: Send
ar: ارسل

source: Select Option
ar: حدد الختيار

source: No Reading History Available
ar: لا يوجد قائمة قراءات

source: Average Glucose
ar: معدل السكر

source: Standard Deviation
ar: الانحراف المعياري

# Above Target
source: Abnormal
ar: Out of Normal Range

# In Range
source: Normal
ar: Within Normal Range

source: Median
ar: Progress

# ENTER_USERNAME
source: Email
ar: البريد الالكتروني

# ENTER_PASSWORD
source: Password
ar: كلمة السر

source: Login
ar: دخول

source: Forgot Password?
ar: نسيت كلمة السر؟

source: Login Error
ar: خطأ تسجيل دخول

source: Add Glucose Level
ar: أضف مستوى السكر

# ENTER_YOUR_GLUCOSE
source: Enter Your Glucose Level Reading
ar: أضف مستوى قراءة السكر

source: e.g.
ar: مثلا

# CHOOSE_TIMING
source: Choose your timing
ar: اختر وقت القراءة

# POST
source: After 2 hours
ar: بعد ساعتين

# PRE
source: Before
ar: قبل

source: Done
ar: تم

# Please select condition
source: Please select Before/After 2 hours
ar: الرجاء تحديد قبل أو بعد ساعتين

# Please input valid number
source: Please input a valid number
ar: الرجاء ادخال رقم صحيح

source: Data missing
ar: بيانات مفقودة

source: Comments?
ar: تعليق؟

source: Invalid Reading
ar: قراءة غير صالحة

source: Your reading has to be less than 600mg/dl
ar: أرجو ادخال قراءة أقل من 600mg/dl

source: Patient Info
ar: معلومات المريض

source: Reading History
ar: القراءات

source: Care Plan
ar: خطة العلاج

source: Patients
ar: مرضي

source: Doctors
ar: أطباء

# MED_DOSAGE
source: Dosage
ar: الجرعة

# MED_FREQUENCY
source: Frequency
ar: الموعد

# MED_CONDITION
source: Condition
ar: الحالة

source: No Medications Available
ar: لا يوجد دواء

source: Take the following readings
ar: خذ القراءات الآتية

source: Loading readings plan
ar: جار تحميل خطة القراءات

# ADD_READING_LABEL
source: Add New Reading
ar: أضف قراءة

source: Today
ar: اليوم

# SEVEN_DAYS
source: 7 Days
ar: ٧ أيام

# FOURTEEN_DAYS
source: 14 Days
ar: ١٤ يوم

# THIRTY_DAYS
source: 30 Days
ar: ٣٠ يوم

source: Condition
ar: الحالة

source: Comment
ar: تعليق

source: Please wait
ar: الرجاء الانتظار

source: Audio Call
ar: مكالمة صوتية

source: Video Call
ar: مكالمة فيديو

source: The character limit is
ar: عدد الأحرف المسموح بها

source: Your Device can't make a phone call
ar: هاتفك لا يستطيع اجراء مكالمة تيليفونية

source: Username
ar: اسم المستخدم

source: Choose language
ar: اختار لغة

source: All conditions
ar: كل الحالات

source: Timing
ar: موعد

source: Fasting
ar: صائم

source: Add another medicine
ar: أضف دواء اخر

source: No Readings Available
ar: لا يوجد قراءات

source: SAVE
ar: احفظ

source: Also on call:
ar: أيضا علي الخط :

source: Enter Medicine Name
ar: اكتب اسم الدواء

source: Edit
ar: تعديل

# Goal
source: Normal Range
ar: هدف

source: status
ar: الحالة

source: Last message
ar: آخر رسالة

source: Inbox
ar: الصندوق الوارد

source: After Breakfast
ar: بعد الفطور

source: After Lunch
ar: بعد الغداء

source: Incoming Audio Call
ar: مكالمة هاتفية

source: Name
ar: اسم

source: 30 min before a meal
ar: ٣٠ دقيقة قبل الوجبة

source: Snacks
ar: وجبة خفيفة

source: Exercise
ar: تمربن

source: Before Breakfast
ar: قبل الفطور

source: Before Lunch
ar: قبل الغداء

source: Before Dinner
ar: قبل العشاء

source: After Dinner
ar: بعد العشاء

source: Dinner
ar: العشاء

source: Breakfast
ar: الفطور

source: Lunch
ar: الغداء

source: Bedtime
ar: وقت النوم

source: 1 time a day
ar: مرة في الأسبوع

source: 2 times a day
ar: مرتين فب الأسبوع

source: 3 times a day
ar: ثلاث مرات في الأسبوع

source: 4 times a day
ar: مرة يوميا

source: 5 times a day
ar: مرتين يوميا

source: Add
ar: أضف

source: Medicine Name Required.
ar: اسم الدواء مطلوب

source: Dosage Required.
ar: الجرعة مطلوبة

source: Frequency Required.
ar: عدد المرات مطلوب

source: Condition Required.
ar: الحالة مطلوبة

source: Error in adding medication. Please try again.
ar: خطأ في اضافة الدواء. الرجاء المحاولة مرة آخري

source: List View
ar: عرض القوائم

source: Chart View
ar: عرض الرسم البياني

# Medications
source: Medication
ar: الأدوية

# Readings
source: Monitoring
ar: القراءات

source: Out of Range
ar: خارج النطاق

source: Normal Range
ar: النطاق العادي

source: Normal Range: 70 to 130
ar: النطاق العادي: ٧٠ الي ١٣٠

source: Normal Range: Under 180
ar: النطاق العادي: تحت ١٨٠

source: Normal Range: 130 to 180
ar: النطاق العادي: ١٣٠ الي ١٨٠

source: Normal Range: 80 to 130
ar: النطاق العادي: ٨٠ الي ١٣٠

source: CONFIRM
ar: تأكيد

source: CANCEL
ar: الغاء

source: Please enter the missing fields
ar: الرجاد ملأ الخانات المفقودة

source: Medication must have one condition and dosage
ar: الدواء يجب أن يكون به حالة واحدة و جرعة واحدة

source: Medication Updated
ar: م تحديث الدواء

source: Medication Added
ar: تمت اضافة الدواء

source: edit
ar: تعديل

source: Save
ar: احفظ

# ADD_MEDICATION_LABEL
source: Add Medication
ar: أضف دواء

source: HC#
ar: رقم البطاقة الصحبة

source: Sex
ar: الجنس

source: Age
ar: العمر

source: BMI
ar: مؤشر كتلة الجسم

# Diabetec
source: Diabetic
ar: مريض بالسكر

source: Duration
ar: المدة

source: Cholestrol
ar: كوليسترول

source: Other diseases
ar: أمراض أخرى

source: Bio Data
ar: بيانات السيرة الذاتية

# Disease Details
source: Health Data
ar: تفاصيل المرض

source: Gestation Period
ar: مدة الحمل

source: Ultrasound
ar: ألترا ساوند

source: G-Intake
ar: قراءة السكر

source: Report
ar: تقرير

source: Confirmation
ar: تأكيد

# Change date and time
source: Change Date & Time
ar: غير التاريخ و الوقت

source: Take the following readings
ar: خذ القراءات الآتية

source: Once a week
ar: مرة في الأسبوع

source: Twice a week
ar: مرتين في الأسبوع

source: Thrice a week
ar: ثلاث مرات في الأسبوع

source: Once daily
ar: مرة يوميا

source: Twice daily
ar: مرتين يوميا

# Create a new account
source: Create new account
ar: انشأ حساب جديد

source: Forgot password
ar: نسيت كلمة السر

source: Patient Report
ar: تقرير المريض

source: Summary
ar: الملخص

source: Diabetes
ar: داء السكري

source: Glucose Readings
ar: قراءات السكر

source: Current Medications
ar: الأدوية الحالية

source: Current Reading Schedule
ar: جدول القراءات الحالي

source: SAVE CHANGES
ar: حفظ التغيرات

source: APPROVE
ar: موافق

source: DECLINE
ar: رفض

source: Send Request to Doctor
ar: ارسل الطلب الي الطبيب

source: Report Emergency
ar: تقرير الطوارئ

source: Request Decline. Please inform the educator using group chat
ar: تم رفض الطلب.الرجاء اخطار المثقفة عبر الدردشة الجماعية

source: Report Approved. Please inform the respective educator through group chat.
ar: تمت الموافقة علي التقرير. الرجاء اخطار المثقفة عبر الدردشة الجماعية

source: Changes made
ar: تم التغيير

source: No Change
ar: لا يوجد تغيير

source: Request sent to doctor
ar: تم ارسال الطلب الي الطبيب

source: Comments By Doctor
ar: الطبیب تعلیقات

source: 1 hour after breakfast
ar: ساعة بعد الفطور

# 2 hours after breakfast
source: 1 hour after breakfast
ar: ساعتين بعد الفطور

source: 1 hour before lunch
ar: ساعة قبل الغداء

source: 2 hours before lunch
ar: ساعتين قبل الغداء

source: 1 hour before dinner
ar: ساعة قبل العشاء

source: 2 hours before dinner
ar: ساعتين قبل العشاء

source: 1 hour after lunch
ar: ساعة بعد الغداء

source: 2 hours after lunch
ar: ساعتين بعد الغداء

source: 1 hour after dinner
ar: ساعة بعد العشاء

source: 2 hours after dinner
ar: ساعتين بعد العشاء

source: 1/week
ar: مرة في الأسبوع

source: 2/week
ar: مرتين في الأسبوع

source: 3/week
ar: ثلاث مرات في الأسبوع

source: Daily
ar: يوميا

source: 2/Daily
ar: مرتين يوميا

source: Educator:
ar: المثقفة:

source: Doctor:
ar: الطبيب:

source: Patient:
ar: المريض:

source: Accepted
ar: تمت الموافقة

source: Declined
ar: تم الرفض

source: Pending
ar: قيد الانتظار

source: Requests
ar: طلبات

source: ago
ar: ماضي

source: week
ar: أسبوع

source: Yesterday
ar: أمس

source: hour
ar: ساعة

source: minute
ar: دقيقة

source: days ago
ar: أيام مضت

source: Just now
ar: الآن

source: second
ar: ثانية

# SA_STR_ENTER_TIMING
source: Enter Timing
ar: أدخل التوقيت

# SA_STR_ENTER_FREQUNECY
source: Enter Frequnecy
ar: أدخل التردد

# SA_STR_ENTER_GOAL
source: Enter Goal
ar: أدخل هدف

# SA_STR_ENTER_MEDICATION
source: Enter Medicine Name
ar: أدخل اسم الطب

# SA_STR_ENTER_DOSE
source: Dose
ar: جرعة

# SA_STR_ENTER_Timing
source: Timing
ar: توقيت

# Please add comments to justify your decision
source: Please add comments?
ar: Please explain changes (if any)

source: Changes saved. Please inform the patient through group chat
ar: Changes saved. Notification has been sent to the patient and the educator(s)
